---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceSubFolder.#ctor(System.String,System.String)
source: html/eda4042b-29ea-82ef-5a41-11456428aff9.htm
---
# Autodesk.Revit.DB.ExternalResourceSubFolder.#ctor Method

Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path.

## Syntax (C#)
```csharp
public ExternalResourceSubFolder(
	string folderName,
	string iconPath
)
```

## Parameters
- **folderName** (`System.String`) - Folder displayed name.
- **iconPath** (`System.String`) - The path of the resource icon.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null